---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.RequestOrphanMullionDeletion
source: html/cd1f2826-b53e-3af7-1623-4c6e4ceb5776.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.RequestOrphanMullionDeletion Property

Due to the changes in parameters of their hosts some mullions became non-type driven.

## Syntax (C#)
```csharp
public static FailureDefinitionId RequestOrphanMullionDeletion { get; }
```